nxp-mcuxpresso/mcux-soc-svd/MCXC162/MCXC162.xml
<?xml version="1.0" encoding="UTF-8"?>
<device schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>nxp.com</vendor>
  <name>MCXC162</name>
  <version>1.0</version>
  <description>MCXC162VFG,MCXC162VFK,MCXC162VFM,MCXC162VFT,MCXC162VLF</description>
  <licenseText>
Copyright 2016-2026 NXP
SPDX-License-Identifier: BSD-3-Clause
  </licenseText>
  <cpu>
    <name>other</name>
    <revision>r1p0</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>true</fpuPresent>
    <vtorPresent>true</vtorPresent>
    <nvicPrioBits>2</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <peripherals>
    <peripheral>
      <name>INPUTMUX0</name>
      <description>INPUTMUX</description>
      <groupName>INPUTMUX</groupName>
      <baseAddress>0x40001000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xA40</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CTIMER0CAP[%s]</name>
          <description>Capture select register for CTIMER inputs</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INP</name>
              <description>Input number for CTIMER0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val1</name>
                  <description>CT_INP0 input is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>CT_INP1 input is selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>CT_INP2 input is selected</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>CT_INP3 input is selected</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>CT_INP4 input is selected</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>CT_INP5 input is selected</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>CT_INP6 input is selected</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>CT_INP8 input is selected</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>CT_INP9 input is selected</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val13</name>
                  <description>CT_INP12 input is selected</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val14</name>
                  <description>CT_INP13 input is selected</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val17</name>
                  <description>CT_INP16 input is selected</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val18</name>
                  <description>CT_INP17 input is selected</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val19</name>
                  <description>CT_INP18 input is selected</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val20</name>
                  <description>CT_INP19 input is selected</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val26</name>
                  <description>ADC0_tcomp[0] input is selected</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val27</name>
                  <description>ADC0_tcomp[1] input is selected</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val28</name>
                  <description>ADC0_tcomp[2] input is selected</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val29</name>
                  <description>ADC0_tcomp[3] input is selected</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val30</name>
                  <description>CMP0_OUT input is selected</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val33</name>
                  <description>CTimer1_MAT1 input is selected</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val34</name>
                  <description>CTimer1_MAT2 input is selected</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val35</name>
                  <description>CTimer1_MAT3 input is selected</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val44</name>
                  <description>PWM0_SM0_MUX_TRIG0 input is selected</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val45</name>
                  <description>PWM0_SM1_MUX_TRIG0 input is selected</description>
                  <value>0x2D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val46</name>
                  <description>PWM0_SM2_MUX_TRIG0 input is selected</description>
                  <value>0x2E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val48</name>
                  <description>LPI2C0 Master End of Packet input is selected</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val49</name>
                  <description>LPI2C0 Slave End of Packet input is selected</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val52</name>
                  <description>LPSPI0 End of Frame input is selected</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val53</name>
                  <description>LPSPI0 Received Data Word input is selected</description>
                  <value>0x35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val56</name>
                  <description>LPUART0 Received Data Word input is selected</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val57</name>
                  <description>LPUART0 Transmitted Data Word input is selected</description>
                  <value>0x39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val58</name>
                  <description>LPUART0 Receive Line Idle input is selected</description>
                  <value>0x3A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val59</name>
                  <description>LPUART1 Received Data Word input is selected</description>
                  <value>0x3B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val60</name>
                  <description>LPUART1 Transmitted Data Word input is selected</description>
                  <value>0x3C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val61</name>
                  <description>LPUART1 Receive Line Idle input is selected</description>
                  <value>0x3D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val62</name>
                  <description>LPUART2 Received Data Word input is selected</description>
                  <value>0x3E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val63</name>
                  <description>LPUART2 Transmitted Data Word input is selected</description>
                  <value>0x3F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val64</name>
                  <description>LPUART2 Receive Line Idle input is selected</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val65</name>
                  <description>TRIG_IN0 input is selected</description>
                  <value>0x41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val66</name>
                  <description>TRIG_IN1 input is selected</description>
                  <value>0x42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val67</name>
                  <description>TRIG_IN2 input is selected</description>
                  <value>0x43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val68</name>
                  <description>TRIG_IN3 input is selected</description>
                  <value>0x44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val69</name>
                  <description>TRIG_IN4 input is selected</description>
                  <value>0x45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val70</name>
                  <description>TRIG_IN5 input is selected</description>
                  <value>0x46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val71</name>
                  <description>TRIG_IN6 input is selected</description>
                  <value>0x47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val72</name>
                  <description>TRIG_IN7 input is selected</description>
                  <value>0x48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val73</name>
                  <description>TRIG_IN8 input is selected</description>
                  <value>0x49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val74</name>
                  <description>TRIG_IN9 input is selected</description>
                  <value>0x4A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val75</name>
                  <description>TRIG_IN10 input is selected</description>
                  <value>0x4B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val76</name>
                  <description>TRIG_IN11 input is selected</description>
                  <value>0x4C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val77</name>
                  <description>LPUART3 Received Data Word input is selected</description>
                  <value>0x4D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val78</name>
                  <description>LPUART3 Transmitted Data Word input is selected</description>
                  <value>0x4E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val79</name>
                  <description>LPUART3 Receive Line Idle input is selected</description>
                  <value>0x4F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
