nxp-mcuxpresso/mcux-soc-svd/MCXC162/MCXC162.xml
        <register>
          <name>OSCCFGA</name>
          <description>Oscillator Configuration A</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMP_TRIM</name>
              <description>Comparator Trim</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMP_760</name>
                  <description>760 mV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP_770</name>
                  <description>770 mV</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP_740</name>
                  <description>740 mV</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP2_TRIM</name>
              <description>CAP2_TRIM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLY_TRIM</name>
              <description>Delay Trim</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DLY_9_6</name>
                  <description>P current 9(nA) and N Current 6(nA)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_13_6</name>
                  <description>P current 13(nA) and N Current 6(nA)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_4_6</name>
                  <description>P current 4(nA) and N Current 6(nA)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_9_4</name>
                  <description>P current 9(nA) and N Current 4(nA)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_13_4</name>
                  <description>P current 13(nA) and N Current 4(nA)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_4_4</name>
                  <description>P current 4(nA) and N Current 4(nA)</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_9_2</name>
                  <description>P current 9(nA) and N Current 2(nA)</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_13_2</name>
                  <description>P current 13(nA) and N Current 2(nA)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_4_2</name>
                  <description>P current 4(nA) and N Current 2(nA)</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP_TRIM</name>
              <description>Capacitor Trim</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL0</name>
                  <description>Default (when CAP2_TRIM = 0 and CAP_TRIM[1:0] = 00 )</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL1</name>
                  <description>-1us (when CAP2_TRIM = 0 and CAP_TRIM[1:0] = 01)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL2</name>
                  <description>-2us (when CAP2_TRIM = 0 and CAP_TRIM[1:0] = 10) or or +3.5us (when CAP2_TRIM = 1 and CAP_TRIM[1:0] = 10)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL3</name>
                  <description>-2.5us (when CAP2_TRIM = 0 and CAP_TRIM[1:0] = 11) or +1us (when CAP2_TRIM = 1 and CAP_TRIM[1:0] = 11)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INIT_TRIM</name>
              <description>Initialization Trim</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL0</name>
                  <description>8 s</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL1</name>
                  <description>4 s</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL2</name>
                  <description>2 s</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL3</name>
                  <description>1 s</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL4</name>
                  <description>0.5 s</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL5</name>
                  <description>0.25 s</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL6</name>
                  <description>0.125 s</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL7</name>
                  <description>0.5 ms</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCLCKA</name>
          <description>Oscillator Lock A</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Do not block</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Block</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCLKE</name>
          <description>Oscillator Clock Enable</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLKE</name>
              <description>Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FROCTLA</name>
          <description>FRO16K Control A</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRO_EN</name>
              <description>FRO16K Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FROLCKA</name>
          <description>FRO16K Lock A</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Do not block</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Block</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FROCLKE</name>
          <description>FRO16K Clock Enable</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLKE</name>
              <description>Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>WAKEUP[%s]</name>
          <description>Array of registers: WAKEUPA</description>
          <addressOffset>0x700</addressOffset>
          <register>
            <name>WAKEUPA</name>
            <description>Wakeup 0 Register A</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>REG</name>
                <description>Register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>WAKLCKA</name>
          <description>Wakeup Lock A</description>
          <addressOffset>0x7F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Lock is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Lock is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
